{
  "sad": {
    "acknowledge": [
      "I'm really sorry you're feeling this way.",
      "That sounds incredibly difficult to deal with.",
      "I can hear the sadness in your words.",
      "Those feelQings sound really heavy to carry.",
      "I'm sorry you're going through such a tough time.",
      "Your pain comes through in your message."
    ],
    "support": [
      "Would you like to talk about what's making you feel this way?",
      "Sometimes sharing can help lighten the burden.",
      "Have you been able to reach out to someone you trust?",
      "Would a brief breathing exercise help right now?",
      "Is there anything small that might bring you a bit of comfort today?",
      "What usually helps when you're feeling down?"
    ],
    "reinforce": [
      "It takes courage to share how you're feeling.",
      "You're not alone in this, even when it feels that way.",
      "Your feelings are completely valid and understandable.",
      "You've made it through difficult times before.",
      "Reaching out shows real strength.",
      "Your sadness doesn't define your worth."
    ]
  },
  "happy": {
    "acknowledge": [
      "That's wonderful to hear! I can feel your joy.",
      "You sound absolutely delighted - that's amazing!",
      "What fantastic news! Your happiness is contagious.",
      "I love hearing such positive energy from you!",
      "That sounds like such a bright moment in your day!",
      "Your joy really shines through!"
    ],
    "support": [
      "Tell me more about what's bringing you such happiness!",
      "What was the best part of this experience?",
      "I'd love to hear all the wonderful details!",
      "How are you planning to celebrate this joy?",
      "What does this happiness mean to you?",
      "How can you carry this joy forward?"
    ],
    "reinforce": [
      "You absolutely deserve this happiness!",
      "It's beautiful to see you so joyful.",
      "These are the moments worth savoring and celebrating.",
      "Your excitement is truly heartwarming.",
      "Keep embracing these wonderful feelings!",
      "Joy like yours makes the world brighter."
    ]
  },
  "angry": {
    "acknowledge": [
      "I can sense your frustration and anger.",
      "That sounds really aggravating and upsetting.",
      "Your anger is completely understandable.",
      "I can feel the intensity of your emotions.",
      "That would make anyone feel angry.",
      "Your frustration comes through clearly."
    ],
    "support": [
      "What's at the core of this frustration?",
      "Would it help to talk through what happened?",
      "Sometimes expressing anger helps us process it.",
      "What would help you feel more in control right now?",
      "Is there a way to channel this energy constructively?",
      "What boundaries might help protect your peace?"
    ],
    "reinforce": [
      "Your feelings are completely valid.",
      "It's healthy to acknowledge when you're upset.",
      "You have every right to feel this way.",
      "Anger can signal that something important to you is at stake.",
      "You're handling a difficult situation.",
      "Your emotions matter and deserve to be heard."
    ]
  },
  "fearful": {
    "acknowledge": [
      "That sounds genuinely frightening.",
      "I can understand why you'd feel scared about this.",
      "Fear can be so overwhelming and paralyzing.",
      "Your anxiety about this makes complete sense.",
      "That uncertainty would make anyone feel afraid.",
      "I can hear the worry in your words."
    ],
    "support": [
      "What would help you feel safer right now?",
      "Let's think about what aspects you can control.",
      "Would some grounding techniques help calm your mind?",
      "What's one small step you could take today?",
      "Who in your life makes you feel most secure?",
      "What has helped you cope with fear before?"
    ],
    "reinforce": [
      "It takes real courage to face your fears.",
      "You're stronger and more resilient than you know.",
      "Acknowledging fear is the first step to addressing it.",
      "You've overcome scary situations before.",
      "Your caution shows wisdom and self-awareness.",
      "Feeling afraid doesn't make you weak."
    ]
  },
  "love": {
    "acknowledge": [
      "What a beautiful and powerful feeling!",
      "Love is such a profound and amazing emotion.",
      "I can feel the warmth and affection in your words.",
      "There's something magical about the way you describe this.",
      "Your love radiates through your message.",
      "What a wonderful connection you're experiencing!"
    ],
    "support": [
      "Tell me more about this special person or thing you love!",
      "What makes this love so meaningful and deep?",
      "How does this love enrich and impact your life?",
      "What are your favorite moments with them?",
      "How do you like to express this love?",
      "What drew you to them in the first place?"
    ],
    "reinforce": [
      "Love is one of life's greatest and most precious gifts.",
      "You deserve to give and receive abundant love.",
      "These deep connections make life truly meaningful.",
      "Your capacity for love is a beautiful strength.",
      "Love like this is worth celebrating and cherishing.",
      "You're creating something really special together."
    ]
  },
  "optimistic": {
    "acknowledge": [
      "Your optimism is genuinely inspiring!",
      "I love your positive and hopeful outlook!",
      "What a wonderfully hopeful perspective you have!",
      "Your positivity is truly refreshing to hear.",
      "There's such brightness in your words.",
      "Your hope and confidence shine through!"
    ],
    "support": [
      "What's fueling this incredible positive energy?",
      "Share more about what's got you feeling so hopeful!",
      "Your optimism might inspire others around you too!",
      "How can you nurture and maintain this positive outlook?",
      "What possibilities are you most excited about?",
      "What's giving you such confidence in the future?"
    ],
    "reinforce": [
      "Your positive attitude is a real strength and asset.",
      "Optimism can be such a powerful force for good.",
      "Keep nurturing and protecting that hopeful spirit!",
      "Your outlook can create positive change around you.",
      "Hope like yours can overcome many obstacles.",
      "You're choosing to see possibility where others might not."
    ]
  },
  "stressed": {
    "acknowledge": [
      "I can really feel the stress and pressure in your message.",
      "That sounds incredibly overwhelming right now.",
      "It sounds like you're carrying a heavy load on your shoulders.",
      "I can understand why you'd feel so pressured and stressed.",
      "That level of stress must be absolutely exhausting.",
      "You're dealing with so much at once."
    ],
    "support": [
      "Let's try breaking this down into smaller, manageable pieces.",
      "Would a quick grounding exercise help you feel more centered?",
      "What feels like the most urgent thing to address first?",
      "Sometimes taking just 5 deep breaths can help reset your mind.",
      "Is there one small step you could take right now to feel more in control?",
      "What support systems do you have available?"
    ],
    "reinforce": [
      "You're handling so much - that shows incredible resilience.",
      "It's smart and wise to recognize when you're feeling overwhelmed.",
      "You've managed stressful situations before and found your way through.",
      "Taking time to acknowledge your stress is actually a healthy first step.",
      "You don't have to figure everything out all at once.",
      "Your ability to keep going despite stress is admirable."
    ]
  },
  "neutral": {
    "acknowledge": [
      "I'm here to listen and support you.",
      "Thank you for sharing with me today.",
      "I appreciate you taking the time to talk.",
      "Your thoughts and feelings matter to me.",
      "I'm glad you're here to chat.",
      "I'm present and ready to listen."
    ],
    "support": [
      "What's on your mind today?",
      "Is there anything particular you'd like to talk about?",
      "How has your day been treating you?",
      "What would be most helpful for you right now?",
      "I'm here if you need someone to listen.",
      "What's been occupying your thoughts lately?"
    ],
    "reinforce": [
      "Your thoughts and feelings are important and valid.",
      "It's good that you're taking time for yourself.",
      "You're doing great by checking in with yourself.",
      "I'm grateful you chose to share with me.",
      "You deserve care, support, and understanding.",
      "Your presence here matters."
    ]
  }
}